modules/intlog/controllers/IntlogfoldersController.php

    public function actionViewrole($role)
    {
        if (($this->checkUser()) !== 'intlog') {
            throw new ForbiddenHttpException('Access denied');
        }
        $model = Rolememberof::findAll([
            'role' => $role,
        ]);
        $model2 = Rolemembers::findAll([
            'role' => $role,
        ]);
---
SELECT * FROM `rolememberof` WHERE `role`='ROLE IntLog_GSA_RO'
SELECT * FROM `rolemembers` WHERE `role`='ROLE IntLog_GSA_RO'

    public function actionView2($folder)
    {
        if (($this->checkUser()) !== 'intlog') {
            throw new ForbiddenHttpException('Access denied');
        }
        #$model = new Intlogfolders();

     /*   $model = Intlogfolders::findAll([
            'folder' => 'O:\IntLog\93_LOR11\10_R11_Отдел_доставки',
            ]);*/
        $model = Intlogfolders::findAll([
            'folder' => $folder,
        ]);
---
SELECT * FROM `intlogfolders` WHERE `folder`='O:\\IntLog\\88_LO921\\65_921_Инженеры'